#ifndef __HAL_BUZZER_H__
#define __HAL_BUZZER_H__


/*********************************************************************
 * INCLUDES
 */


/*********************************************************************
 * CPPMIX
 */
#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************
 * MACROS
 */


/*********************************************************************
* TYPEDEFS
*/


/*********************************************************************
 * CONSTANTS
 */


/*********************************************************************
 * LOCAL VARIABLES
 */


/*********************************************************************
 * GLOBAL VARIABLES
 */


/*********************************************************************
 * LOCAL FUNCTIONS
 */


/*********************************************************************
 * GLOBAL FUNCTIONS
 */
/**
 * @brief 初始化蜂鸣器硬件
 *
 * 此函数用于初始化蜂鸣器所需的硬件资源，如GPIO、定时器等。
 * 调用此函数后，蜂鸣器将处于可使用状态。
 */
extern void hal_buzzer_init(void);

/**
 * @brief 设置蜂鸣器的频率和持续时间
 *
 * 此函数用于设置蜂鸣器的发声频率和持续时间。
 * @param frequency 蜂鸣器的发声频率，单位为Hz
 * @param duration_ms 蜂鸣器的发声持续时间，单位为毫秒
 */
extern void hal_buzzer_set(uint32_t frequency, uint32_t duration_ms);


#ifdef __cplusplus
}
#endif

#endif /* __HAL_BUZZER_H__ */
